iarsystems/ewarm-nxp-example-projects/LPC40xx/IAR-LPC-4088-SK/USB_Host/Host/Host/usbhost_lpc408x.c
/*
**************************************************************************************************************
*                                                 NXP USB Host Stack
*
*                                     (c) Copyright 2008, NXP SemiConductors
*                                     (c) Copyright 2008, OnChip  Technologies LLC
*                                                 All Rights Reserved
*
*                                                  www.nxp.com
*                                               www.onchiptech.com
*
* File           : usbhost_lpc2468.c
* Programmer(s)  : Ravikanth.P
* Version        :
*
**************************************************************************************************************
*/

/*
**************************************************************************************************************
*                                            INCLUDE HEADER FILES
**************************************************************************************************************
*/

#include  "usbhost_lpc408x.h"
#include  "LPC407x_8x.h"

/*
**************************************************************************************************************
*                                              GLOBAL VARIABLES
**************************************************************************************************************
*/

volatile  USB_INT32U   HOST_RhscIntr = 0;         /* Root Hub Status Change interrupt                       */
volatile  USB_INT32U   HOST_WdhIntr  = 0;         /* Semaphore to wait until the TD is submitted            */
volatile  HCED        *EDCtrl;                    /* Control endpoint descriptor structure                  */
volatile  HCED        *EDBulkIn;                  /* BulkIn endpoint descriptor  structure                  */
volatile  HCED        *EDBulkOut;                 /* BulkOut endpoint descriptor structure                  */
volatile  HCTD        *TDHead;                    /* Head transfer descriptor structure                     */
volatile  HCTD        *TDTail;                    /* Tail transfer descriptor structure                     */
volatile  HCCA        *Hcca;                      /* Host Controller Communications Area structure          */
volatile  USB_INT08U  *TDBuffer;                  /* Current Buffer Pointer of transfer descriptor          */
volatile  USB_INT08U  *FATBuffer;                 /* Buffer used by FAT file system                         */
volatile  USB_INT08U  *UserBuffer;                /* Buffer used by application                             */

/*
**************************************************************************************************************
*                                         DELAY IN MILLI SECONDS
*
* Description: This function provides a delay in milli seconds
*
* Arguments  : delay    The delay required
*
* Returns    : None
*
**************************************************************************************************************
*/

void  Host_DelayMS (USB_INT32U  delay)
{
    volatile  USB_INT32U  i;


    for (i = 0; i < delay; i++) {
        Host_DelayUS(1000);
    }
}

/*
**************************************************************************************************************
*                                         DELAY IN MICRO SECONDS
*
* Description: This function provides a delay in micro seconds
*
* Arguments  : delay    The delay required
*
* Returns    : None
*
**************************************************************************************************************
*/

void  Host_DelayUS (USB_INT32U  delay)
{
    volatile  USB_INT32U  i;


    for (i = 0; i < (4 * delay); i++) {    /* This logic was tested. It gives app. 1 micro sec delay        */
        ;
    }
}

/*
**************************************************************************************************************
*                                         INITIALIZE THE HOST CONTROLLER
*
* Description: This function initializes lpc2468 host controller
*
* Arguments  : None
*
* Returns    :
*
**************************************************************************************************************
*/

void  Host_Init (void)
{

    /*Turn on USB*/
    LPC_SC->PCONP |= (1ul<<31);

    NVIC_DisableIRQ(USB_IRQn);                                /* Disable the USB interrupt source           */
    LPC_USB->OTGClkCtrl  = 0x00000009;                        /* Enable USB host clock                      */

    while ((LPC_USB->OTGClkSt & 0x00000001) == 0) {
    }
    
    LPC_USB->StCtrl = 0x00000001;                 /**/
                                   
    LPC_IOCON->P0_31 = 0x1;                       /* P0[31] = USB_D+2                         */
                                                              
    LPC_IOCON->P1_30 = 0x1A1;                     /* P1[30] = USB_PWRD2                       */
    LPC_IOCON->P1_31 = 0x1A1;                     /* P1[31] = USB_OVRCR2                      */
    LPC_IOCON->P0_12 = 0x1A1;                     /* P0[12] = USB_PPWR2                       */
                                                                
    PRINT_Log("Initializing Host Stack\n\r");
    Hcca       = (volatile  HCCA       *)0x20000000;
    TDHead     = (volatile  HCTD       *)0x20000100;
    TDTail     = (volatile  HCTD       *)0x20000110;
    EDCtrl     = (volatile  HCED       *)0x20000120;
    EDBulkIn   = (volatile  HCED       *)0x20000130;
    EDBulkOut  = (volatile  HCED       *)0x20000140;
    TDBuffer   = (volatile  USB_INT08U *)0x20000150;
    FATBuffer  = (volatile  USB_INT08U *)0x200001D0;
    UserBuffer = (volatile  USB_INT08U *)0x20001000;

                                                              /* Initialize all the TDs, EDs and HCCA to 0  */
    Host_EDInit(EDCtrl);
    Host_EDInit(EDBulkIn);
    Host_EDInit(EDBulkOut);
    Host_TDInit(TDHead);
    Host_TDInit(TDTail);
    Host_HCCAInit(Hcca);


    Host_DelayMS(50);                                         /* Wait 50 ms before apply reset              */
    HcControl       = 0;                                      /* HARDWARE RESET                             */
    HcControlHeadED = 0;                                      /* Initialize Control list head to Zero       */
    HcBulkHeadED    = 0;                                      /* Initialize Bulk list head to Zero          */

                                                              /* SOFTWARE RESET                             */
    HcCommandStatus = OR_CMD_STATUS_HCR;
    HcFmInterval    = DEFAULT_FMINTERVAL;              /* Write Fm Interval and Largest Data Packet Counter */

                                                              /* Put HC in operational state                */
    HcControl  = (HcControl & (~OR_CONTROL_HCFS)) | OR_CONTROL_HC_OPER;
    HcRhStatus = OR_RH_STATUS_LPSC;                           /* Set Global Power                           */

    HcHCCA = (USB_INT32U)Hcca;
    HcInterruptStatus |= HcInterruptStatus;                   /* Clear Interrrupt Status                    */
                                                              /* Enable  interrupts                         */
    HcInterruptEnable  = OR_INTR_ENABLE_MIE |
                         OR_INTR_ENABLE_WDH |
                         OR_INTR_ENABLE_RHSC;


    NVIC_EnableIRQ(USB_IRQn);                                 /* Enable the USB interrupt source            */
    PRINT_Log("Host Initialized\n\r");
}

